{
	"title": "Projects",
	"gitCard": {
		"frontTitle": "More over at my github",
		"backSubtitle": "You can find some other projects of mine, interests, among other things.",
		"coverImgName": "github",
		"url": "https://github.com/Retchut/"
	},
	"projects": [
		{
			"title": "Shifteam",
			"description": [
				"Shifteam empowers managers to effortlessly craft efficient schedules, allowing them to allocate more time to prioritize essential responsibilities. With an exceptional user interface with an intuitive and responsive design, we guarantee a user-friendly experience for anyone."
			],
			"contributions": [
				"I was the bridge between the design team and the development team, actively participating in the application's UI and UX design",
				"Directed the design implementation on the back-office application",
				"Developed and performed refactoring tasks on multiple UI components of the back-office application",
				"Single-handedly implemented the design for the company's brand website"
			],
			"imgName": "shifteam",
			"tags": ["Web"],
			"techs": ["React", "Tailwind", "Django"],
			"projectURL": "https://www.shifteam.pt"
		},
		{
			"title": "VR A-Frame Explorer",
			"description": [
				"Project focused on both exploring the generation of photo-realistic 3D models based on real places, and on the development of a platform to explore these models on."
			],
			"imgName": "vr-aframe-explorer",
			"contributions": [
				"Captured a dataset of images for the model generation",
				"Generated models based on the image dataset with photogrammetry, and in real time with LiDAR technology",
				"Developed a WebXR platform to view and explore the models on",
				"Ported some of Felix Mariotto's three-mesh-ui library to A-Frame, in order to help with UI creation",
				"Developed a simple web server to host and serve our models, and allow uploading custom models"
			],
			"tags": ["Web", "XR"],
			"techs": ["A-Frame", "Meshroom", "Express", "Vite", "Photogrammetry", "LiDAR"],
			"projectURL": "https://github.com/Retchut/vr-aframe-explorer"
		},
		{
			"title": "Atlas of Anatomical Pathology",
			"description": [
				"An online Atlas of Anatomical Pathology. Still a WIP.",
				"An educative tool made for a Veterinary Medicine teacher."
			],
			"imgName": "atlas",
			"contributions": [
				"Designed the interface and UI",
				"Developed the front-end application, implementing the design",
				"Developed a web server to host and serve the application content",
				"Host, perform maintenance and updates on the server and content, among other DevOps tasks"
			],
			"tags": ["Web"],
			"techs": ["React", "Tailwind", "Express", "MongoDB"],
			"projectURL": "https://github.com/Retchut/atlas"
		},
		{
			"title": "Portfolio Website",
			"description": [
				"Repository holding this website's code.",
				"Serves as a little archive of what I'm up to."
			],
			"contributions": ["Designed the interface and UI", "Implemented the design"],
			"imgName": "website",
			"tags": ["Web"],
			"techs": ["Svelte", "Tailwind", "CSS", "Vite"],
			"projectURL": "https://github.com/Retchut/retchut.github.io"
		},
		{
			"title": "Arch Quick Setup",
			"description": [
				"Some scripts and files to make setting up my OS on a fresh install just the way I like it.",
				"Just clone the repo and run the script, and you'll have my workstation up and running."
			],
			"contributions": [],
			"imgName": "arch-quick-setup",
			"tags": ["Utility"],
			"techs": ["Bash", "Linux"],
			"projectURL": "https://github.com/Retchut/arch-quick-setup"
		}
	]
}
